sims/SIM_Slosh_50/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.02;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;

maxAlphaCo      0.2;

functions
{
    forces
    {
        type            forces;
        functionObjectLibs ( "libforces.so" );
        writeControl    adjustableRunTime;
        writeInterval   0.005;
        patches         ( walls );
        rho             rhoInf;
        rhoInf          1000;
        CofR            ( 0 0 0 );
    }
    liquidCOM
    {
        type            liquidCOM;
        libs            ( "libliquidCOM.so" );
        region          region0;
        executeControl  adjustableRunTime;
        executeInterval 0.005;
        writeControl    adjustableRunTime;
        writeInterval   0.005;
    }
}



// ************************************************************************* //
