sims/SIM_Slosh_50/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*--------------------------------*- C++ -*----------------------------------*\
| Refined slosh mesh: top/interface fine, bottom coarse                     |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1;

// ============================================================
// Geometry
// ============================================================
// Tank: width = 0.4167, depth = 0.1, height = 1

vertices
(
    // Bottom (z = 0)
    (0       0   0)    // 0
    (0.4167  0   0)    // 1
    (0.4167  0.1 0)    // 2
    (0       0.1 0)    // 3

    // z = 0.4
    (0       0   0.4)  // 4
    (0.4167  0   0.4)  // 5
    (0.4167  0.1 0.4)  // 6
    (0       0.1 0.4)  // 7

    // z = 0.7
    (0       0   0.7)  // 8
    (0.4167  0   0.7)  // 9
    (0.4167  0.1 0.7)  //10
    (0       0.1 0.7)  //11

    // z = 0.8 (interface region)
    (0       0   0.8)  //12
    (0.4167  0   0.8)  //13
    (0.4167  0.1 0.8)  //14
    (0       0.1 0.8)  //15

    // Top (z = 1.0)
    (0       0   1.0)  //16
    (0.4167  0   1.0)  //17
    (0.4167  0.1 1.0)  //18
    (0       0.1 1.0)  //19
);

// ============================================================
// Blocks
// ============================================================

blocks
(
    // Bottom (coarse)
    hex (0 1 2 3 4 5 6 7)
    (50 5 75)
    simpleGrading (1 1 1)

    // Mid-lower (medium)
    hex (4 5 6 7 8 9 10 11)
    (50 5 75)
    simpleGrading (1 1 1)

    // Interface band (fine)
    hex (8 9 10 11 12 13 14 15)
    (50 5 75)
    simpleGrading (1 1 1)

    // Top air (very fine)
    hex (12 13 14 15 16 17 18 19)
    (50 5 75)
    simpleGrading (1 1 1)
);

// ============================================================
// Edges
// ============================================================

edges
(
);

// ============================================================
// Boundaries
// ============================================================

boundary
(
    walls
    {
        type wall;
        faces
        (
            // bottom
            (0 1 2 3)

            // top
            (16 17 18 19)

            // sides
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (3 7 4 0)

            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (7 11 8 4)

            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
            (11 15 12 8)

            (12 16 17 13)
            (13 17 18 14)
            (14 18 19 15)
            (15 19 16 12)
        );
    }
);

// ============================================================

mergePatchPairs
(
);
// ************************************************************************* //
